# 世界是一切发生的事物
# 人只能通过感官看到事物，而无法发现真相
# 感官的异化会导致认知的异化
# 任何试图描述真相的言语之人都无法做到客观真实，带上了描述人的主观意识
# 没有任何想法是完美无缺的，任何理论一定会有崩塌之时
# 也没有任何事情是完全无法发生的，只是在我们这个世界发生概率太小
# 小概率之事发生之后即为事实，属于这个世界的一部分，被称为奇迹
# 世界的价值在世界之外，不能在世界内部寻找到真正的意义
# 无法预料未来
# 我们活在后果之中
# 现有世界是真实的，我们不需要虚妄的替代
# 世界没有另一面，只是认知的角度发生了变化

# 用世界去描述世界
TheWorld = []
# 第一域谓之认知之域
MindArea = []
# 你需要认识自己
MindArea.append("know yourself")
# 在这里绝无法欺骗

# 死亡也是

# 记忆构成了心灵

# 你将去过去找回记忆

# 第二域属于记忆之域

# 记忆是模糊的

# 事实无法改变，但记忆能

# 你永远能成为你自己想成为的人

# 如果不曾看过光明，人们永远无法追求光明

# 第三域属于意识之域

# 记忆可以消散，但想法不会

# 恶意永远存在，无关你的愿景

# 现在是时候，于你头脑的恶魔战斗了

# 我们永远拥有黑暗

# 但光明永恒

# 第四域属于现实之域

# 过去之事无法改变

# 未来之事无法预知

# 我们活在当下

# 现在就是唯一的真实

# 去引发奇迹吧，只要有概率，一万次的轮回也能成功

# 最后，回到心灵之中，你将找到最后的答案

