import pygame
from pygame.locals import *
from pygame_new_start.mysprite import MySprite

feeling_dict = {
    '实干': 0, '坦率': 0, '浮躁': 0, '孤独': 0,
    '勇敢': 0, '淘气': 0, '大胆': 0, '马虎': 0,
    '冷静': 0, '沉着': 0, '狂妄': 0, '胆小': 0,
    '急躁': 0, '天真': 0, '开朗': 0, '悠闲': 0
                }
question_dict = {'蛋糕已经超过一天的保质期了，怎么办啊？':
                     [('1.没关系，继续吃', '悠闲+1/勇敢+2'), ('2.犹豫再三，不吃', '胆小+1'), ('3.找谁尝一下味道', '大胆+2')],
                 '明天有非常重要的考试，你会……':
                     [('1.彻夜学习', '实干+2'), ('2.车到山前必有路了啦', '悠闲+2'), ('3.咦？怎么有些发烧了？', '天真+2')],
                 '你会冒冒失失的随便说话吗？':
                     [('1.会', '马虎+2/孤独+2'), ('2.不会', '实干+1')],
                 '与一个不太爱说话的朋友独处时，你会怎么做呢？':
                     [('1.一起拉家常', '沉着+1'), ('2.什么也不说', '浮躁+1'), ('3.找个理由脱身', '胆小+2')],
                 '虽然觉得不太好笑，但是大家都在大笑，你会怎么办呢？':
                     [('1.还是觉得不好笑', '大胆+1/勇敢+2'), ('2.跟着一起笑', '胆小+1/孤独+2'), ('3.视情况而定', '浮躁+1/冷静+1')],
                 '有一个好消息和一个坏消息，你想先听哪个？':
                     [('1.好消息', '悠闲+2'), ('2.坏消息', '大胆+1/天真+2'), ('3.两个都不听', '胆小+2')],
                 '比起在家里，更多的是在户外玩吗？':
                     [('1.是', '马虎+2/淘气+2'), ('2.不是', '沉着+1')],
                 '从遗迹中发现了古代的宝箱，你会怎么办？':
                     [('1.打开看看', '马虎+1/急躁+2/勇敢+2/淘气+2'), ('2.请别人帮忙打开', '胆小+1')],
                 '忙碌的生活和悠闲的生活更喜欢哪一种呢？':
                     [('1.忙碌的生活', '孤独+2/狂妄+1'), ('2.悠闲的生活', '沉着+2'), ('3.劳逸结合最好', '浮躁+2')],
                 '有对已经见过一次面的人打招呼说成“初次见面”的情况吗？':
                     [('1.有', '马虎+2/浮躁+2'), ('2.没有', '沉着+1')],
                 '一旦决定的事能坚持做到最后吗？':
                     [('1.能', '实干+2'), ('2.不能', '浮躁+2/急躁+1')],
                 '你是不是心里在想，什么时候一定要变大了来给我看看？':
                     [('1.是', '狂妄+2'), ('2.不是', '沉着+1')],
                 '是否有过“从自家院子里也能挖出金块”的想法？':
                     [('1.有', '天真+2'), ('2.没有', '冷静+1')],
                 '来到电影院后最想看哪种电影呢？':
                     [('1.动作电影', '狂妄+1/淘气+2'), ('2.感人电影', '实干+2'), ('3.恋爱电影', '浮躁+2')],
                 '做春游准备时突然想吃零食了，怎么办呢？':
                     [('1.稍稍吃一点', '急躁+2'), ('2.拼命忍住', '实干+2'), ('3.醒来时发现全没了', '马虎+2')],
                 '已经吃的非常饱的时候又上来一道最喜欢的甜点，该怎么办？':
                     [('1.硬撑着也要吃下去', '马虎+1/急躁+2'), ('2.已经饱了，决定放弃', '实干+1'), ('3.如果只是甜点的话应该没问题', '大胆+2/悠闲+1/开朗+2')],
                 '得到了一大包土特产，你会？':
                     [('1.回去之前不会打开', '坦率+2'), ('2.急着打开', '天真+2'), ('3.当场打开', '马虎+2'), ('4.似乎比大家的包裹小啊……', '孤独+2')],
                 '想买的人气游戏在自己眼前被卖完了，你会……':
                     [('1.无可奈何', '沉着+2'), ('2.气炸了！', '悠闲+2/开朗+2'), ('3.伤心的哭了', '孤独+2')],
                 '是否有过“看着镜子楼里面的自己，觉得非常帅”的想法？':
                     [('1.是', '狂妄+2/天真+1/开朗+1'), ('2.不是', '实干+1')],
                 '老师有将妈妈叫去过学校吗？':
                     [('1.有', '马虎+2/大胆+1'), ('2.没有', '冷静+1')],
                 '传说学校的厕所有怪物出没，你会……':
                     [('1.不害怕', '胆小+1/坦率+2'), ('2.全当没听过', '大胆+1/悠闲+1/开朗+2')],
                 '忘记是否买过了的情况下还会再一次买同一样东西吗？':
                     [('1.会', '马虎+1/浮躁+2/急躁+1'), ('2.不会', '冷静+1')],
                 '非常喜欢唱卡拉OK吗？':
                     [('1.是', '大胆+2/开朗+2'), ('2.不是', '胆小+1/坦率+1')],
                 '有时会感觉自己滔滔不绝，光顾说自己的事情吗？':
                     [('1.会', '马虎+2/急躁+2'), ('2.不会', '坦率+1/冷静+1')],
                 '昨天买的玩具今天再去看时半价了，你会…..':
                     [('1.无比沮丧…', '实干+2'), ('2.好后悔啊！', '坦率+2'), ('3.时机不好啊', '沉着+2/大胆+2')],
                 '到昨天为止都好好的朋友突然不理自己了，你觉得是为什么？':
                     [('1.身体不舒服吗？', '急躁+2'), ('2.恍然大悟', '冷静+2'), ('3.什么？什么啊？', '胆小+1')],
                 '你的早上都是什么样的？':
                     [('1.经常很赶', '勇敢+2/淘气+2'), ('2.一直都刚好时间', '冷静+1'), ('3.提前很早就去', '胆小+2/坦率+1')],
                 '你的背后好像有谁…….不转身看一下？':
                     [('1.好可怕，快住手！', '胆小+2'), ('2.什么啊，骗人呀！', '坦率+2'), ('3.不会被捉到的啦！', '孤独+2/狂妄+2'), ('4.哎？什么? ', '悠闲+2')],
                 '你的学习习惯是？':
                     [('1.每日孜孜不倦', '实干+2'), ('2.心血来潮时学一下', '浮躁+2/急躁+1'), ('3.踏实的学', '冷静+1'), ('4.不是一个人时无法学习', '孤独+2')],
                 '脱掉鞋子后发现两只袜子的颜色不一样，你会……':
                     [('1.感到不安', '坦率+2'), ('2.又穿错了！', '马虎+2'), ('3.就要这种样式的袜子', '开朗+2')],
                 '有今年的目标了吗？':
                     [('1.有', '实干+2'), ('2.没有', '马虎+1/浮躁+2'), ('3.那是什么？', '悠闲+2')],
                 '在安静无比的会场中突然传出了一声“噗”的可爱响声，你会怎么做？':
                     [('1.哈哈哈！大爆炸啦！', '天真+1/开朗+2'), ('2.装作没听见', '坦率+1/淘气+1'), ('3.谁呀！ 一脸焦躁的样子', '勇敢+2')],
                 '你认为自己是很能学习的人吗？':
                     [('1.是', '坦率+2'), ('2.不是', '马虎+1/天真+2'), ('3.如果是体育的话一定不会输！', '淘气+2')],
                 '正在上课时突然想上厕所怎么办？':
                     [('1.举手后去厕所', '大胆+2/勇敢+2'), ('2.悄悄去厕所', '急躁+1'), ('3.拼命忍到下课', '胆小+1')],
                 '看见开关会不由自主的按下去吗？':
                     [('1.是', '急躁+2'), ('2.不是', '沉着+1')],
                 '被邀请参加一个绝妙的派对，但是时间到了一个人也没有，你会怎么办？':
                     [('1.发生了什么事吗？', '孤独+2/坦率+2'), ('2.难道搞错了吗？', '悠闲+2/开朗+2'), ('3.一个人先开始吧', '大胆+2')],
                 '能直率的说出“对不起”吗？':
                     [('1.能说出', '坦率+2/大胆+1'), ('2.难以开口', '胆小+2/孤独+1')],
                 '太失败了！要是让大家发现的话就惨了……你该怎么办呢？':
                     [('1.拼命掩饰', '胆小+1'), ('2.找个借口', '狂妄+1/天真+2'), ('3.装死', '马虎+2')],
                 '想向非常喜欢的人告白，你会怎么做？':
                     [('1.先邀出去玩', '开朗+2/冷静+1'), ('2.用恶作剧吸引注意力', '孤独+2/天真+1'), ('3.远远的大叫“我爱你” ', '大胆+1/勇敢+2/淘气+2'), ('4.因为害怕什么也不做', '胆小+1')],
                 '彩票中了大奖，你会….. ':
                     [('1.太开心了！', '天真+2/开朗+1'), ('2.不敢相信', '胆小+1'), ('3.不告诉任何人', '冷静+2')],
                 '发现了超实惠的低价商品，你会怎么办？':
                     [('1.马上就去买！', '急躁+2'), ('2.考虑是否真的需要', '冷静+1'), ('3.等着再降价', '大胆+2')],
                 '被拜托了一个麻烦的事，你会怎么办？':
                     [('1.一个人努力做', '实干+2/勇敢+1'), ('2.找人帮忙', '坦率+1'), ('3.丢给其他人做', '大胆+2/狂妄+1')],
                 '你认为适度的偷懒也是必要的吗？':
                     [('1.是', '大胆+2/冷静+2'), ('2.不是', '勇敢+2'), ('3.不知道', '坦率+2')],
                 '电话铃响了，你会怎么办？':
                     [('1.赶紧接', '孤独+2/急躁+2'), ('2.等一会儿接', '冷静+1'), ('3.假装不在', '胆小+1')],
                 '你认为有时的牺牲也是必要的吗？':
                     [('1.是', '狂妄+2/冷静+2'), ('2.不是', '勇敢+2')],
                 '听见邻桌唱起了生日歌，你会怎么办？':
                     [('1.和气的注视着他们', '沉着+1'), ('2.一起唱', '天真+2/开朗+2'), ('3.不在意', '孤独+1/狂妄+2')],
                 '听见朋友们正在制定游戏计划，你会…..':
                     [('1.希望一起参与！', '天真+2'), ('2.无所谓', '孤独+2'), ('3.会不会被邀请呢？', '胆小+1')],
                 '朋友说要请你吃饭，你会怎么办？':
                     [('1.谢谢啦！', '大胆+2'), ('2.哎呀，我还有事！', '开朗+2'), ('3.是吗？不好意思了', '浮躁+2')],
                 '朋友做的饭好难吃，但被问及“味道怎么样”是你会怎么办？':
                     [('1.难吃！', '勇敢+1/冷静+1'), ('2.微微一笑', '沉着+2/孤独+1'), ('3.呜…..恩，很好吃哦', '胆小+1/马虎+1')],
                 '有朋友约定的时间过了，你会再等一会儿吗？':
                     [('1.会', '大胆+2/悠闲+1'), ('2.不会', '孤独+2/急躁+1')],
                 '你是否认为无论做什么都要去争取第一名才好呢？':
                     [('1.是', '孤独+1/狂妄+2'), ('2.不是', '沉着+2/浮躁+1')],
                 '你是否非常喜欢热闹的派对？':
                     [('1.喜欢', '孤独+1/开朗+2'), ('2.不喜欢', '冷静+1')],
                 '你是否认为人生的是不用想太多，顺其自然更好呢？':
                     [('1.是', '悠闲+2/开朗+1'), ('2.不是', '冷静+1')],
                 '看见松软的床不知不觉间……':
                     [('1.跳上去', '急躁+1/狂妄+1'), ('2.扑上去', '淘气+2'), ('3.卷成一团', '孤独+2')],
                 '正在发呆时被朋友突然泼了冷水，你会怎么办？':
                     [('1.真的生气了', '急躁+2'), ('2.伤心的哭了', '孤独+2'), ('3.好！开一场水仗吧！', '天真+2/开朗+2/淘气+2')],
                 '走在前面的伙伴结实的摔了一跤，你会怎么办？':
                     [('1.马上去帮忙', '孤独+1/勇敢+2'), ('2.情不自禁的笑了', '马虎+1/天真+2/淘气+2')],
                 '走在路上突然收到了采访，你会怎么办？':
                     [('1.害羞的逃跑', '胆小+2'), ('2.大大方方的回答', '狂妄+2/勇敢+2'), ('3.小XX，看见我了吗？', '大胆+1/天真+2')],
                 '马拉松开始时突然摔倒了，你会怎么办?':
                     [('1.还不能放弃！', '实干+2/勇敢+1'), ('2.绝望的坐在地上', '浮躁+2'), ('3.大叫“重新开始”', '马虎+1/大胆+2')],
                 '给大家发的点心好像只剩一个了，你会…..':
                     [('1.不告诉任何人', '胆小+1/大胆+2'), ('2.告诉大家', '马虎+2/坦率+2'), ('3.先到先得！', '淘气+2')],
                 '在大家面前耍宝时有冷场的情况发生吗？':
                     [('1.有', '天真+2'), ('2.没有', '沉着+2')],
                 '前往一家听说非常好吃的饭店好吃，你会点什么样的套餐呢？':
                     [('1.肉特别多的套餐', '天真+2/淘气+2'), ('2.健康的鱼肉套餐', '实干+1'), ('3.开开心心的吃个大杂烩套餐', '大胆+2')],
                 '山道在前面分开了，你会选走哪边？':
                     [('1.狭窄的道路', '天真+1/淘气+2'), ('2.宽广的道路', '胆小+1/浮躁+2')],
                 '是否想成为名人？':
                     [('1.想', '孤独+2/狂妄+2'), ('2.不想', '悠闲+1')],
                 '遇到坏人的时候，会非常警惕呢？':
                     [('1.会', '大胆+1/狂妄+2/勇敢+2'), ('2.不会', '胆小+1')]
                 }


def display_question(font, game_screen, q_count, q_dict):
    flx = None
    wb = list(q_dict.keys())[q_count]
    text = font.render(wb, True, BLUE, WHITE)
    text_rect = (x, y)
    game_screen.blit(text, text_rect)
    n_x, n_y = x, y
    for index, item in enumerate(q_dict[wb]):
        font_color = BLUE
        ls = item[0]
        xx = ls_count % len(q_dict[wb])
        if xx == index:
            font_color = GREEN
            flx = item[1]
        text = font.render(ls, True, font_color, WHITE)
        n_x, n_y = n_x, n_y + 40
        text_rect = (n_x, n_y)
        game_screen.blit(text, text_rect)
    return flx


def add_feel(flx_x, f_dict):
    feeling_list = flx_x.split('/')
    for feel in feeling_list:
        fl_list = feel.split('+')
        fl1 = fl_list[0]
        fl2 = int(fl_list[1])
        f_dict[fl1] += fl2


def display_feel(font, f_dict, game_screen):
    mi = 0
    ls = ''
    flx = ''
    for ff in f_dict.keys():
        if f_dict[ff] > mi:
            ls = "你大概是%s的性格,现在进入游戏吧！" % ff
            flx = ff
            mi = f_dict[ff]
    text = font.render(ls, True, BLUE, WHITE)
    text_rect = (x, y)
    game_screen.blit(text, text_rect)
    return flx


BLACK = (0, 0, 0)
WHITE = (255, 255, 255)
RED = (255, 0, 0)
GREEN = (0, 255, 0)
BLUE = (0, 0, 255)
PINK = (255, 192, 203)# 粉红
VIOLET = (238, 130, 238)# 紫罗兰
PURPLE = (128, 0, 128)# 紫
SKYBLUE = (135, 206, 235)# 天蓝
CYAN = (0, 255, 255)# 青
GLOD = (255, 215, 0)# 金
ORANGE = (255, 165, 0)# (*≧︶≦))(￣▽￣* )ゞ
CHOCOLATE = (210, 105, 30)# 巧克力
ORANGERED = (255, 69, 0)# 橙红
SPRINGGREEN = (0, 255, 127)# 春🦌
pygame.init()
screen = pygame.display.set_mode((800, 600), 0, 32)
pygame.display.set_caption("初始问题")
print(pygame.font.get_fonts())
basicFont = pygame.font.SysFont('幼圆', 25)
framerate = pygame.time.Clock()
count = 0
l = len(question_dict.keys())
x, y = 0, 0
ls_count = 0
fl = None
while True:
    framerate.tick(30)
    ticks = pygame.time.get_ticks()
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            pygame.quit()
            exit()
        if event.type == KEYDOWN:
            if event.key == pygame.K_UP:
                ls_count -= 1
            if event.key == pygame.K_DOWN:
                ls_count += 1
            if event.key == pygame.K_RETURN:
                count += 1
                ls_count = 0
                if fl:
                    add_feel(fl, feeling_dict)
    key = pygame.key.get_pressed()
    if 1 in key:
        print(key.index(1))
    if key[pygame.K_a]:
        x = x-10
    if key[pygame.K_w]:
        y = y+10
    if key[pygame.K_d]:
        x = x+10
    if key[pygame.K_s]:
        y = y-10
    if key[pygame.K_ESCAPE]:
        exit()
    screen.fill(WHITE)
    if count < l:
        fl = display_question(basicFont, screen, count, question_dict)
    else:
        max_feel = display_feel(basicFont, feeling_dict, screen)
    pygame.display.update()

